In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
df_original = pd.read_csv("/content/SLU Opportunity Wise Data-1710158595043 - Sheet1.csv")
df1 = df_original.copy() # making a copy of the original dataset.

In [ ]:
df1.tail(5)

,Learner SignUp DateTime,Opportunity Id,Opportunity Name,Opportunity Category,Opportunity End Date,First Name,Date of Birth,Gender,Country,Institution Name,Current/Intended Major,Entry created at,Status Description,Status Code,Apply Date,Opportunity Start Date
8553,03/05/2024 16:39:21,00000000-10GQ-RJHT-3G4S-BKGBY1,Freelance Mastery workshop,Event,03/08/2024 11:30:00,Selam,10/14/2006,Female,Ethiopia,Lideta Catholic Cathedral School,Computer Science,03/11/2024 12:03:14,Team Allocated,1070,03/05/2024 17:10:41,03/08/2024 14:00:00
8554,03/06/2024 15:58:47,00000000-10GQ-RJHT-3G4S-BKGBY1,Freelance Mastery workshop,Event,03/08/2024 11:30:00,Gowri Sailesh,05/18/1999,Male,United States,SAINT LOUIS UNIVERSITY,Information Systems,03/11/2024 12:03:14,Team Allocated,1070,03/06/2024 18:22:11,03/08/2024 14:00:00
8555,02/29/2024 15:02:31,00000000-10GQ-RJHT-3G4S-BKGBY1,Freelance Mastery workshop,Event,03/08/2024 11:30:00,Abiola,03/16/1999,Male,Nigeria,Tai Solarin university of Education,Political Science,03/11/2024 12:03:14,Team Allocated,1070,02/29/2024 15:10:06,03/08/2024 14:00:00
8556,12/23/2023 03:53:12,00000000-10GQ-RJHT-3G4S-BKGBY1,Freelance Mastery workshop,Event,03/08/2024 11:30:00,venumadhavi,06/05/1997,Female,United States,Saint Louis University,Information Systems,03/11/2024 12:03:14,Team Allocated,1070,02/27/2024 06:48:47,03/08/2024 14:00:00
8557,06/01/2023 13:22:01,00000000-10GQ-RJHT-3G4S-BKGBY1,Freelance Mastery workshop,Event,03/08/2024 11:30:00,Prashanth Reddy,11/30/2000,Male,India,Saint Louis University,Artificial Intelligence,03/11/2024 12:03:14,Team Allocated,1070,02/16/2024 16:33:00,03/08/2024 14:00:00

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8558 entries, 0 to 8557
Data columns (total 16 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Learner SignUp DateTime  8558 non-null   object
 1   Opportunity Id           8558 non-null   object
 2   Opportunity Name         8558 non-null   object
 3   Opportunity Category     8558 non-null   object
 4   Opportunity End Date     8558 non-null   object
 5   First Name               8558 non-null   object
 6   Date of Birth            8558 non-null   object
 7   Gender                   8558 non-null   object
 8   Country                  8558 non-null   object
 9   Institution Name         8553 non-null   object
 10  Current/Intended Major   8553 non-null   object
 11  Entry created at         8558 non-null   object
 12  Status Description       8558 non-null   object
 13  Status Code              8558 non-null   int64
 14  Apply Date               8558 non-null   object
 15  Opportunity Start Date   4764 non-null   object
dtypes: int64(1), object(15)
memory usage: 1.0+ MB

### Date related all data's are in object format. so converting it to correct datetime format and also removing the time (as it is not so much relevent)

there were also some problem in %m/%d/%Y and %d/%m/%Y format. that isue was also fixed

In [ ]:
date_columns = [
    'Learner SignUp DateTime',
    'Date of Birth',
    'Apply Date',
    'Opportunity Start Date',
    'Opportunity End Date',
    'Entry created at'
]

In [ ]:
for col in date_columns:
    df1[col] = df1[col].str.split(" ").str[0]

In [ ]:
df3=df1.copy()

In [ ]:

for col in date_columns:
    df3[col] = pd.to_datetime(
        df3[col],
        format="mixed", # as %m/%d/%Y and %d/%m/%Y formats are mixed
        dayfirst=True,
        errors="coerce"
    )

In [ ]:
df3.isna().sum()

Learner SignUp DateTime       0
Opportunity Id                0
Opportunity Name              0
Opportunity Category          0
Opportunity End Date          0
First Name                    0
Date of Birth                 0
Gender                        0
Country                       0
Institution Name              5
Current/Intended Major        5
Entry created at              0
Status Description            0
Status Code                   0
Apply Date                    0
Opportunity Start Date     3794
dtype: int64

In [ ]:
df5 = df3.copy() # converted all dates correctly

In [ ]:
# removing some columns from these rows having null values
df5 = df5.dropna(
    subset=['Institution Name', 'Current/Intended Major']
)

In [ ]:
df5.isna().sum()

Learner SignUp DateTime       0
Opportunity Id                0
Opportunity Name              0
Opportunity Category          0
Opportunity End Date          0
First Name                    0
Date of Birth                 0
Gender                        0
Country                       0
Institution Name              0
Current/Intended Major        0
Entry created at              0
Status Description            0
Status Code                   0
Apply Date                    0
Opportunity Start Date     3790
dtype: int64

In [ ]:
# 8 types of ‘Status Code’ for 8 type of ‘status description’ (co-related) (as they represents each other, so one of them can be removed)
# as "Status Description" is co-related to "Opportunity Start Date", let's drop status code.
df5 = df5.drop(columns=["Status Code"])

In [ ]:
df5.drop(columns='Opportunity Id',inplace=True)

In [ ]:
df6 = df5.copy()

In [ ]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8548 entries, 0 to 8557
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Learner SignUp DateTime  8548 non-null   datetime64[ns]
 1   Opportunity Name         8548 non-null   object
 2   Opportunity Category     8548 non-null   object
 3   Opportunity End Date     8548 non-null   datetime64[ns]
 4   First Name               8548 non-null   object
 5   Date of Birth            8548 non-null   datetime64[ns]
 6   Gender                   8548 non-null   object
 7   Country                  8548 non-null   object
 8   Institution Name         8548 non-null   object
 9   Current/Intended Major   8548 non-null   object
 10  Entry created at         8548 non-null   datetime64[ns]
 11  Status Description       8548 non-null   object
 12  Apply Date               8548 non-null   datetime64[ns]
 13  Opportunity Start Date   4758 non-null   datetime64[ns]
dtypes: datetime64[ns](6), object(8)
memory usage: 1001.7+ KB

In [ ]:
# converting the non-ASCII values(other languages) to english
!pip install unidecode
from unidecode import unidecode
df6["Institution Name"] = df6["Institution Name"].apply(unidecode)

Requirement already satisfied: unidecode in /usr/local/lib/python3.12/dist-packages (1.4.0)

In [ ]:
df6["First Name"] = df6["First Name"].apply(unidecode)

In [ ]:
# some object(data type) columns should be converted to lowercase and then check for duplicates. Also should check ‘Whitespace & hidden character’
object_columns = df6.select_dtypes(include=['object']).columns

# Clean object columns (lowercase + whitespace)
df6[object_columns] = (
    df6[object_columns]
    .astype(str)
    .apply(lambda col: col.str.strip().str.lower())
)

"""
What this fixes:

Male → male
FEMALE → female
USA\t → usa
Bangladesh\n → bangladesh"""

'\nWhat this fixes:\n\nMale → male\nFEMALE → female\nUSA\t → usa\nBangladesh\n → bangladesh'

In [ ]:
df6.duplicated().sum()

np.int64(6)

In [ ]:
df6 = df6.drop_duplicates() # removing these 6 duplicates

In [ ]:
df8 = df6.copy()

In [ ]:
df8.head()

,Learner SignUp DateTime,Opportunity Name,Opportunity Category,Opportunity End Date,First Name,Date of Birth,Gender,Country,Institution Name,Current/Intended Major,Entry created at,Status Description,Apply Date,Opportunity Start Date
0,2023-06-14,career essentials: getting started with your p...,course,2024-06-29,faria,2001-12-01,female,pakistan,nwihs,radiology,2024-11-03,started,2023-06-14,2022-03-11
1,2023-01-05,career essentials: getting started with your p...,course,2024-06-29,poojitha,2000-08-16,female,india,saint louis,information systems,2024-11-03,started,2023-01-05,2022-03-11
2,2023-09-04,career essentials: getting started with your p...,course,2024-06-29,emmanuel,2002-01-27,male,united states,illinois institute of technology,computer science,2024-11-03,started,2023-11-05,2022-03-11
3,2023-08-29,career essentials: getting started with your p...,course,2024-06-29,amrutha varshini,1999-01-11,female,united states,saint louis university,information systems,2024-11-03,team allocated,2023-09-10,2022-03-11
4,2023-06-01,career essentials: getting started with your p...,course,2024-06-29,vinay varshith,2000-04-19,male,united states,saint louis university,computer science,2024-11-03,started,2023-06-01,2022-03-11

In [ ]:
df8["Institution Name"] = (
    df8["Institution Name"]
    .astype(str)
    .str.lower()
    .str.strip()
    .str.replace(r"\s+", " ", regex=True)
    .str.replace(r"[^a-z0-9\s]", "", regex=True)
)

In [ ]:
# fixing some errors in Instiuttion Name
corrections = {
    r"univeristy|universitiy": "university",
    r"instiute": "institute",
    r"techonology|technologie": "technology",
    r"coliege|colege": "college",
    r"&": "and",
    r"\bst\.\b|\bst\b": "saint",
    r"\buniv\b|\buni\b": "university",
    r"\binst\b": "institute",
    r"\bengg\b|\beng\b": "engineering",
    r"\btech\b": "technology",
    r"\bint\b": "international",
}


for wrong, correct in corrections.items():
    df8["Institution Name"] = df8["Institution Name"].str.replace(
        wrong, correct, regex=True
    )

In [ ]:
places = [
    # Bangladesh
    "dhaka", "chittagong", "rajshahi", "khulna", "sylhet",
    "barisal", "rangpur", "mymensingh", "ashulia", "gazipur",
    "tungipara", "gopalganj",

    # Countries
    "bangladesh", "india", "pakistan", "nigeria", "ghana", "egypt",
    "kenya", "uganda", "zimbabwe",

    # Indian states / regions
    "kerala", "punjab", "karnataka", "maharashtra", "tamil nadu",
    "uttar pradesh", "rajasthan", "gujarat", "bihar", "bengal",
    "kashmir", "delhi", "ekiti state", "benue state", "delta state",
    "nassarawa state", "imo state", "ebonyi state", "taraba state",
    "kwara state", "uttarakhand", "ondo state", "kaduna state",

    # Cities (India)
    "mumbai", "pune", "bangalore", "hyderabad", "chennai", "kolkata",
    "nagpur", "jaipur", "lucknow", "patna", "bhopal", "indore",
    "coimbatore", "jodhpur", "noida", "greater noida", "allahabad",
    "nuzvid", "jalgaonmh", "awka", "ogbomoso", "perambalur",

    # Cities (Africa)
    "mardan", "uturu", "bauchi", "karu", "attock", "abraka",
    "effurun", "kano", "lagos", "accra", "cairo", "nairobi",

    # USA / Other cities
    "chicago",

    # Misc noisy suffixes
    "campus", "online", "new", "state"
]


pattern = r"(?<!of\s)\b(" + "|".join(places) + r")\b$"  # don't remove country name in case: "University of Delhi"


df8["Institution Name"] = df8["Institution Name"].str.replace(
    pattern, "", regex=True
).str.strip()

In [ ]:
df8["Institution Name"].value_counts()

Institution Name
saint louis university                                      4330
illinois institute of technology                             160
saint louis                                                   93
webster university                                            72
kwame nkrumah university of science and technology            35
                                                            ...
emperical college                                              1
mankessim senior high technical school                         1
saint louis universitymadrid                                   1
mustuniversity                                                 1
lasbela university of agriculture water  marine sciences       1
Name: count, Length: 1728, dtype: int64

In [ ]:
# here i am converting "saint louis" to "saint louis university"
df8["Institution Name"] = df8["Institution Name"].replace(
    r"^saint louis$", "saint louis university", regex=True
)

In [ ]:
df8["Institution Name"].value_counts()

Institution Name
saint louis university                                4423
illinois institute of technology                       160
webster university                                      72
kwame nkrumah university of science and technology      35
srm university                                          32
                                                      ...
cedar college                                            1
francis howell north high school                         1
defence cambridge                                        1
utem                                                     1
government stanley medical college                       1
Name: count, Length: 1727, dtype: int64

In [ ]:
df9 = df8.copy()

here for "First Name"
1. If a value contains both letters and numbers → remove numbers
2. If a value contains only numbers → replace with "unknown"

In [ ]:
# Step 1: replace pure numbers with "unknown"
df9["First Name"] = df9["First Name"].replace(
    r"^\d+$", "unknown", regex=True
)

# Step 2: remove numbers from mixed values
df9["First Name"] = df9["First Name"].str.replace(
    r"\d+", "", regex=True
).str.strip()

In [ ]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8542 entries, 0 to 8557
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Learner SignUp DateTime  8542 non-null   datetime64[ns]
 1   Opportunity Name         8542 non-null   object
 2   Opportunity Category     8542 non-null   object
 3   Opportunity End Date     8542 non-null   datetime64[ns]
 4   First Name               8542 non-null   object
 5   Date of Birth            8542 non-null   datetime64[ns]
 6   Gender                   8542 non-null   object
 7   Country                  8542 non-null   object
 8   Institution Name         8542 non-null   object
 9   Current/Intended Major   8542 non-null   object
 10  Entry created at         8542 non-null   datetime64[ns]
 11  Status Description       8542 non-null   object
 12  Apply Date               8542 non-null   datetime64[ns]
 13  Opportunity Start Date   4755 non-null   datetime64[ns]
dtypes: datetime64[ns](6), object(8)
memory usage: 1001.0+ KB

In [ ]:
df9.head()

,Learner SignUp DateTime,Opportunity Name,Opportunity Category,Opportunity End Date,First Name,Date of Birth,Gender,Country,Institution Name,Current/Intended Major,Entry created at,Status Description,Apply Date,Opportunity Start Date
0,2023-06-14,career essentials: getting started with your p...,course,2024-06-29,faria,2001-12-01,female,pakistan,nwihs,radiology,2024-11-03,started,2023-06-14,2022-03-11
1,2023-01-05,career essentials: getting started with your p...,course,2024-06-29,poojitha,2000-08-16,female,india,saint louis university,information systems,2024-11-03,started,2023-01-05,2022-03-11
2,2023-09-04,career essentials: getting started with your p...,course,2024-06-29,emmanuel,2002-01-27,male,united states,illinois institute of technology,computer science,2024-11-03,started,2023-11-05,2022-03-11
3,2023-08-29,career essentials: getting started with your p...,course,2024-06-29,amrutha varshini,1999-01-11,female,united states,saint louis university,information systems,2024-11-03,team allocated,2023-09-10,2022-03-11
4,2023-06-01,career essentials: getting started with your p...,course,2024-06-29,vinay varshith,2000-04-19,male,united states,saint louis university,computer science,2024-11-03,started,2023-06-01,2022-03-11

In [ ]:
# marging don't want to specify and other to Unknown
df9["Gender"] = df9["Gender"].replace({
    "don't want to specify": "unknown",
    "other": "unknown"
})

In [ ]:
df9["First Name"].value_counts().sort_index()

First Name
              1
-             2
-r-           1
aakash       10
aamna         1
             ..
zeendi        1
zoe           2
zohaib        2
zulal         1
zynb n`mn     1
Name: count, Length: 2891, dtype: int64

In [ ]:
df9["First Name"] = df9["First Name"].replace(
    ["", ".", "-", "-r-"],
    "unknown"
)

In [ ]:
df9["First Name"].value_counts().sort_index()

First Name
aakash       10
aamna         1
aaron         1
aastha        3
abah          4
             ..
zeendi        1
zoe           2
zohaib        2
zulal         1
zynb n`mn     1
Name: count, Length: 2888, dtype: int64

In [ ]:
df10=df9.copy()



# Feature Engineering

In [ ]:
# extracted Age of the applicant at the time of application
df10['Age_at_Application_Int'] = (
    (df10['Apply Date'] - df10['Date of Birth']).dt.days // 365
)

In [ ]:
df10['Age_at_Application_Int'].describe()

count    8542.000000
mean       23.735074
std         4.400794
min         3.000000
25%        22.000000
50%        23.000000
75%        25.000000
max        57.000000
Name: Age_at_Application_Int, dtype: float64

In [ ]:
df10['Age_at_Application_Int'].value_counts().sort_index()

# Here we can see that an aplicant is 3 years old, which is illogical. so this row is corrupted

Age_at_Application_Int
3        1
12       6
13      22
14      13
15      38
16      95
17     149
18     209
19     273
20     431
21     873
22    1348
23    1473
24    1073
25     778
26     404
27     259
28     233
29     199
30      91
31     110
32      81
33      75
34      72
35      36
36      31
37      25
38      26
39      16
40       7
41      15
42       8
43      13
44      10
45       1
46      25
47       7
48       5
49       1
51       3
52       1
55       5
57       1
Name: count, dtype: int64

In [ ]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8542 entries, 0 to 8557
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Learner SignUp DateTime  8542 non-null   datetime64[ns]
 1   Opportunity Name         8542 non-null   object
 2   Opportunity Category     8542 non-null   object
 3   Opportunity End Date     8542 non-null   datetime64[ns]
 4   First Name               8542 non-null   object
 5   Date of Birth            8542 non-null   datetime64[ns]
 6   Gender                   8542 non-null   object
 7   Country                  8542 non-null   object
 8   Institution Name         8542 non-null   object
 9   Current/Intended Major   8542 non-null   object
 10  Entry created at         8542 non-null   datetime64[ns]
 11  Status Description       8542 non-null   object
 12  Apply Date               8542 non-null   datetime64[ns]
 13  Opportunity Start Date   4755 non-null   datetime64[ns]
 14  Age_at_Application_Int   8542 non-null   int64
dtypes: datetime64[ns](6), int64(1), object(8)
memory usage: 1.0+ MB

In [ ]:
df10['Opportunity End Date'].sort_index()

0      2024-06-29
1      2024-06-29
2      2024-06-29
3      2024-06-29
4      2024-06-29
          ...
8553   2024-08-03
8554   2024-08-03
8555   2024-08-03
8556   2024-08-03
8557   2024-08-03
Name: Opportunity End Date, Length: 8542, dtype: datetime64[ns]

In [ ]:
df10['Institution_Participation_Count'] = (
    df10.groupby('Institution Name')['Institution Name']
         .transform('count')
)

In [ ]:
df11=df10.copy()

DATA VALIDATION

In [ ]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8542 entries, 0 to 8557
Data columns (total 16 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   Learner SignUp DateTime          8542 non-null   datetime64[ns]
 1   Opportunity Name                 8542 non-null   object
 2   Opportunity Category             8542 non-null   object
 3   Opportunity End Date             8542 non-null   datetime64[ns]
 4   First Name                       8542 non-null   object
 5   Date of Birth                    8542 non-null   datetime64[ns]
 6   Gender                           8542 non-null   object
 7   Country                          8542 non-null   object
 8   Institution Name                 8542 non-null   object
 9   Current/Intended Major           8542 non-null   object
 10  Entry created at                 8542 non-null   datetime64[ns]
 11  Status Description               8542 non-null   object
 12  Apply Date                       8542 non-null   datetime64[ns]
 13  Opportunity Start Date           4755 non-null   datetime64[ns]
 14  Age_at_Application_Int           8542 non-null   int64
 15  Institution_Participation_Count  8542 non-null   int64
dtypes: datetime64[ns](6), int64(2), object(8)
memory usage: 1.1+ MB

In [ ]:
df10.isna().sum()

Learner SignUp DateTime               0
Opportunity Name                      0
Opportunity Category                  0
Opportunity End Date                  0
First Name                            0
Date of Birth                         0
Gender                                0
Country                               0
Institution Name                      0
Current/Intended Major                0
Entry created at                      0
Status Description                    0
Apply Date                            0
Opportunity Start Date             3787
Age_at_Application_Int                0
Institution_Participation_Count       0
dtype: int64

In [ ]:
df11= df10.copy()

In [ ]:
df11.to_csv("cleaned_data.csv", index=False)